tdloe/tms320-rpi-serial/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPALOCK register
//
//*****************************************************************************
#define GPIO_GPALOCK_GPIO0        0x1U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO1        0x2U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO2        0x4U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO3        0x8U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO4        0x10U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO5        0x20U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO6        0x40U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO7        0x80U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO8        0x100U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO9        0x200U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO10       0x400U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO11       0x800U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO12       0x1000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO13       0x2000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO14       0x4000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO15       0x8000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO16       0x10000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO17       0x20000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO18       0x40000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO19       0x80000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO20       0x100000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO21       0x200000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO22       0x400000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO23       0x800000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO24       0x1000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO25       0x2000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO26       0x4000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO27       0x8000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO28       0x10000000U  // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO29       0x20000000U  // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO30       0x40000000U  // Configuration Lock bit for
                                               // this pin
#define GPIO_GPALOCK_GPIO31       0x80000000U  // Configuration Lock bit for
                                               // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPACR register
//
//*****************************************************************************
#define GPIO_GPACR_GPIO0          0x1U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO1          0x2U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO2          0x4U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO3          0x8U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO4          0x10U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO5          0x20U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO6          0x40U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO7          0x80U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO8          0x100U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO9          0x200U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO10         0x400U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO11         0x800U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO12         0x1000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO13         0x2000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO14         0x4000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO15         0x8000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO16         0x10000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO17         0x20000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO18         0x40000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO19         0x80000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO20         0x100000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO21         0x200000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO22         0x400000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO23         0x800000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO24         0x1000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO25         0x2000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO26         0x4000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO27         0x8000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO28         0x10000000U  // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO29         0x20000000U  // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO30         0x40000000U  // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPACR_GPIO31         0x80000000U  // Configuration lock commit bit
                                               // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCTRL register
//
//*****************************************************************************
#define GPIO_GPBCTRL_QUALPRD0_S   0U
#define GPIO_GPBCTRL_QUALPRD0_M   0xFFU        // Qualification sampling period
                                               // for GPIO32 to GPIO39
#define GPIO_GPBCTRL_QUALPRD1_S   8U
#define GPIO_GPBCTRL_QUALPRD1_M   0xFF00U      // Qualification sampling period
                                               // for GPIO40 to GPIO47
#define GPIO_GPBCTRL_QUALPRD2_S   16U
#define GPIO_GPBCTRL_QUALPRD2_M   0xFF0000U    // Qualification sampling period
                                               // for GPIO48 to GPIO55
#define GPIO_GPBCTRL_QUALPRD3_S   24U
#define GPIO_GPBCTRL_QUALPRD3_M   0xFF000000U  // Qualification sampling period
                                               // for GPIO56 to GPIO63

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBQSEL1 register
//
//*****************************************************************************
#define GPIO_GPBQSEL1_GPIO32_S    0U
#define GPIO_GPBQSEL1_GPIO32_M    0x3U         // Select input qualification
                                               // type for GPIO32
#define GPIO_GPBQSEL1_GPIO33_S    2U
#define GPIO_GPBQSEL1_GPIO33_M    0xCU         // Select input qualification
                                               // type for GPIO33
#define GPIO_GPBQSEL1_GPIO34_S    4U
#define GPIO_GPBQSEL1_GPIO34_M    0x30U        // Select input qualification
                                               // type for GPIO34
#define GPIO_GPBQSEL1_GPIO35_S    6U
#define GPIO_GPBQSEL1_GPIO35_M    0xC0U        // Select input qualification
                                               // type for GPIO35
#define GPIO_GPBQSEL1_GPIO36_S    8U
#define GPIO_GPBQSEL1_GPIO36_M    0x300U       // Select input qualification
                                               // type for GPIO36
#define GPIO_GPBQSEL1_GPIO37_S    10U
#define GPIO_GPBQSEL1_GPIO37_M    0xC00U       // Select input qualification
                                               // type for GPIO37
#define GPIO_GPBQSEL1_GPIO38_S    12U
#define GPIO_GPBQSEL1_GPIO38_M    0x3000U      // Select input qualification
                                               // type for GPIO38
#define GPIO_GPBQSEL1_GPIO39_S    14U
#define GPIO_GPBQSEL1_GPIO39_M    0xC000U      // Select input qualification
                                               // type for GPIO39
#define GPIO_GPBQSEL1_GPIO40_S    16U
#define GPIO_GPBQSEL1_GPIO40_M    0x30000U     // Select input qualification
                                               // type for GPIO40
#define GPIO_GPBQSEL1_GPIO41_S    18U
#define GPIO_GPBQSEL1_GPIO41_M    0xC0000U     // Select input qualification
                                               // type for GPIO41
#define GPIO_GPBQSEL1_GPIO42_S    20U
#define GPIO_GPBQSEL1_GPIO42_M    0x300000U    // Select input qualification
                                               // type for GPIO42
#define GPIO_GPBQSEL1_GPIO43_S    22U
#define GPIO_GPBQSEL1_GPIO43_M    0xC00000U    // Select input qualification
                                               // type for GPIO43
#define GPIO_GPBQSEL1_GPIO44_S    24U
#define GPIO_GPBQSEL1_GPIO44_M    0x3000000U   // Select input qualification
                                               // type for GPIO44
#define GPIO_GPBQSEL1_GPIO45_S    26U
#define GPIO_GPBQSEL1_GPIO45_M    0xC000000U   // Select input qualification
                                               // type for GPIO45
#define GPIO_GPBQSEL1_GPIO46_S    28U
#define GPIO_GPBQSEL1_GPIO46_M    0x30000000U  // Select input qualification
                                               // type for GPIO46
#define GPIO_GPBQSEL1_GPIO47_S    30U
#define GPIO_GPBQSEL1_GPIO47_M    0xC0000000U  // Select input qualification
                                               // type for GPIO47

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBQSEL2 register
//
//*****************************************************************************
#define GPIO_GPBQSEL2_GPIO48_S    0U
#define GPIO_GPBQSEL2_GPIO48_M    0x3U         // Select input qualification
                                               // type for GPIO48
#define GPIO_GPBQSEL2_GPIO49_S    2U
#define GPIO_GPBQSEL2_GPIO49_M    0xCU         // Select input qualification
                                               // type for GPIO49
#define GPIO_GPBQSEL2_GPIO50_S    4U
#define GPIO_GPBQSEL2_GPIO50_M    0x30U        // Select input qualification
                                               // type for GPIO50
#define GPIO_GPBQSEL2_GPIO51_S    6U
#define GPIO_GPBQSEL2_GPIO51_M    0xC0U        // Select input qualification
                                               // type for GPIO51
#define GPIO_GPBQSEL2_GPIO52_S    8U
#define GPIO_GPBQSEL2_GPIO52_M    0x300U       // Select input qualification
                                               // type for GPIO52
#define GPIO_GPBQSEL2_GPIO53_S    10U
#define GPIO_GPBQSEL2_GPIO53_M    0xC00U       // Select input qualification
                                               // type for GPIO53
#define GPIO_GPBQSEL2_GPIO54_S    12U
#define GPIO_GPBQSEL2_GPIO54_M    0x3000U      // Select input qualification
                                               // type for GPIO54
#define GPIO_GPBQSEL2_GPIO55_S    14U
#define GPIO_GPBQSEL2_GPIO55_M    0xC000U      // Select input qualification
                                               // type for GPIO55
#define GPIO_GPBQSEL2_GPIO56_S    16U
#define GPIO_GPBQSEL2_GPIO56_M    0x30000U     // Select input qualification
                                               // type for GPIO56
#define GPIO_GPBQSEL2_GPIO57_S    18U
#define GPIO_GPBQSEL2_GPIO57_M    0xC0000U     // Select input qualification
                                               // type for GPIO57
#define GPIO_GPBQSEL2_GPIO58_S    20U
#define GPIO_GPBQSEL2_GPIO58_M    0x300000U    // Select input qualification
                                               // type for GPIO58
#define GPIO_GPBQSEL2_GPIO59_S    22U
#define GPIO_GPBQSEL2_GPIO59_M    0xC00000U    // Select input qualification
                                               // type for GPIO59
#define GPIO_GPBQSEL2_GPIO60_S    24U
#define GPIO_GPBQSEL2_GPIO60_M    0x3000000U   // Select input qualification
                                               // type for GPIO60
#define GPIO_GPBQSEL2_GPIO61_S    26U
#define GPIO_GPBQSEL2_GPIO61_M    0xC000000U   // Select input qualification
                                               // type for GPIO61
#define GPIO_GPBQSEL2_GPIO62_S    28U
#define GPIO_GPBQSEL2_GPIO62_M    0x30000000U  // Select input qualification
                                               // type for GPIO62
#define GPIO_GPBQSEL2_GPIO63_S    30U
#define GPIO_GPBQSEL2_GPIO63_M    0xC0000000U  // Select input qualification
                                               // type for GPIO63

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBMUX1 register
//
//*****************************************************************************
#define GPIO_GPBMUX1_GPIO32_S     0U
#define GPIO_GPBMUX1_GPIO32_M     0x3U         // Defines pin-muxing selection
                                               // for GPIO32
#define GPIO_GPBMUX1_GPIO33_S     2U
#define GPIO_GPBMUX1_GPIO33_M     0xCU         // Defines pin-muxing selection
                                               // for GPIO33
#define GPIO_GPBMUX1_GPIO34_S     4U
#define GPIO_GPBMUX1_GPIO34_M     0x30U        // Defines pin-muxing selection
                                               // for GPIO34
#define GPIO_GPBMUX1_GPIO35_S     6U
#define GPIO_GPBMUX1_GPIO35_M     0xC0U        // Defines pin-muxing selection
                                               // for GPIO35
#define GPIO_GPBMUX1_GPIO36_S     8U
#define GPIO_GPBMUX1_GPIO36_M     0x300U       // Defines pin-muxing selection
                                               // for GPIO36
#define GPIO_GPBMUX1_GPIO37_S     10U
#define GPIO_GPBMUX1_GPIO37_M     0xC00U       // Defines pin-muxing selection
                                               // for GPIO37
#define GPIO_GPBMUX1_GPIO38_S     12U
#define GPIO_GPBMUX1_GPIO38_M     0x3000U      // Defines pin-muxing selection
                                               // for GPIO38
#define GPIO_GPBMUX1_GPIO39_S     14U
#define GPIO_GPBMUX1_GPIO39_M     0xC000U      // Defines pin-muxing selection
                                               // for GPIO39
#define GPIO_GPBMUX1_GPIO40_S     16U
#define GPIO_GPBMUX1_GPIO40_M     0x30000U     // Defines pin-muxing selection
                                               // for GPIO40
#define GPIO_GPBMUX1_GPIO41_S     18U
#define GPIO_GPBMUX1_GPIO41_M     0xC0000U     // Defines pin-muxing selection
                                               // for GPIO41
#define GPIO_GPBMUX1_GPIO42_S     20U
#define GPIO_GPBMUX1_GPIO42_M     0x300000U    // Defines pin-muxing selection
                                               // for GPIO42
#define GPIO_GPBMUX1_GPIO43_S     22U
#define GPIO_GPBMUX1_GPIO43_M     0xC00000U    // Defines pin-muxing selection
                                               // for GPIO43
#define GPIO_GPBMUX1_GPIO44_S     24U
#define GPIO_GPBMUX1_GPIO44_M     0x3000000U   // Defines pin-muxing selection
                                               // for GPIO44
#define GPIO_GPBMUX1_GPIO45_S     26U
#define GPIO_GPBMUX1_GPIO45_M     0xC000000U   // Defines pin-muxing selection
                                               // for GPIO45
#define GPIO_GPBMUX1_GPIO46_S     28U
#define GPIO_GPBMUX1_GPIO46_M     0x30000000U  // Defines pin-muxing selection
                                               // for GPIO46
#define GPIO_GPBMUX1_GPIO47_S     30U
#define GPIO_GPBMUX1_GPIO47_M     0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO47

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBMUX2 register
//
//*****************************************************************************
#define GPIO_GPBMUX2_GPIO48_S     0U
#define GPIO_GPBMUX2_GPIO48_M     0x3U         // Defines pin-muxing selection
                                               // for GPIO48
#define GPIO_GPBMUX2_GPIO49_S     2U
#define GPIO_GPBMUX2_GPIO49_M     0xCU         // Defines pin-muxing selection
                                               // for GPIO49
#define GPIO_GPBMUX2_GPIO50_S     4U
#define GPIO_GPBMUX2_GPIO50_M     0x30U        // Defines pin-muxing selection
                                               // for GPIO50
#define GPIO_GPBMUX2_GPIO51_S     6U
#define GPIO_GPBMUX2_GPIO51_M     0xC0U        // Defines pin-muxing selection
                                               // for GPIO51
#define GPIO_GPBMUX2_GPIO52_S     8U
#define GPIO_GPBMUX2_GPIO52_M     0x300U       // Defines pin-muxing selection
                                               // for GPIO52
#define GPIO_GPBMUX2_GPIO53_S     10U
#define GPIO_GPBMUX2_GPIO53_M     0xC00U       // Defines pin-muxing selection
                                               // for GPIO53
#define GPIO_GPBMUX2_GPIO54_S     12U
#define GPIO_GPBMUX2_GPIO54_M     0x3000U      // Defines pin-muxing selection
                                               // for GPIO54
#define GPIO_GPBMUX2_GPIO55_S     14U
#define GPIO_GPBMUX2_GPIO55_M     0xC000U      // Defines pin-muxing selection
                                               // for GPIO55
#define GPIO_GPBMUX2_GPIO56_S     16U
#define GPIO_GPBMUX2_GPIO56_M     0x30000U     // Defines pin-muxing selection
                                               // for GPIO56
#define GPIO_GPBMUX2_GPIO57_S     18U
#define GPIO_GPBMUX2_GPIO57_M     0xC0000U     // Defines pin-muxing selection
                                               // for GPIO57
#define GPIO_GPBMUX2_GPIO58_S     20U
#define GPIO_GPBMUX2_GPIO58_M     0x300000U    // Defines pin-muxing selection
                                               // for GPIO58
#define GPIO_GPBMUX2_GPIO59_S     22U
#define GPIO_GPBMUX2_GPIO59_M     0xC00000U    // Defines pin-muxing selection
                                               // for GPIO59
#define GPIO_GPBMUX2_GPIO60_S     24U
#define GPIO_GPBMUX2_GPIO60_M     0x3000000U   // Defines pin-muxing selection
                                               // for GPIO60
#define GPIO_GPBMUX2_GPIO61_S     26U
#define GPIO_GPBMUX2_GPIO61_M     0xC000000U   // Defines pin-muxing selection
                                               // for GPIO61
#define GPIO_GPBMUX2_GPIO62_S     28U
#define GPIO_GPBMUX2_GPIO62_M     0x30000000U  // Defines pin-muxing selection
                                               // for GPIO62
#define GPIO_GPBMUX2_GPIO63_S     30U
#define GPIO_GPBMUX2_GPIO63_M     0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO63

