tdloe/tms320-rpi-serial/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPBDIR register
//
//*****************************************************************************
#define GPIO_GPBDIR_GPIO32        0x1U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO33        0x2U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO34        0x4U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO35        0x8U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO36        0x10U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO37        0x20U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO38        0x40U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO39        0x80U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO40        0x100U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO41        0x200U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO42        0x400U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO43        0x800U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO44        0x1000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO45        0x2000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO46        0x4000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO47        0x8000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO48        0x10000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO49        0x20000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO50        0x40000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO51        0x80000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO52        0x100000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO53        0x200000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO54        0x400000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO55        0x800000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO56        0x1000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO57        0x2000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO58        0x4000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO59        0x8000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO60        0x10000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO61        0x20000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO62        0x40000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPBDIR_GPIO63        0x80000000U  // Defines direction for this
                                               // pin in GPIO mode

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBPUD register
//
//*****************************************************************************
#define GPIO_GPBPUD_GPIO32        0x1U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO33        0x2U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO34        0x4U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO35        0x8U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO36        0x10U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO37        0x20U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO38        0x40U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO39        0x80U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO40        0x100U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO41        0x200U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO42        0x400U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO43        0x800U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO44        0x1000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO45        0x2000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO46        0x4000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO47        0x8000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO48        0x10000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO49        0x20000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO50        0x40000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO51        0x80000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO52        0x100000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO53        0x200000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO54        0x400000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO55        0x800000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO56        0x1000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO57        0x2000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO58        0x4000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO59        0x8000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO60        0x10000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO61        0x20000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO62        0x40000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPBPUD_GPIO63        0x80000000U  // Pull-Up Disable control for
                                               // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBINV register
//
//*****************************************************************************
#define GPIO_GPBINV_GPIO32        0x1U         // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO33        0x2U         // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO34        0x4U         // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO35        0x8U         // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO36        0x10U        // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO37        0x20U        // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO38        0x40U        // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO39        0x80U        // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO40        0x100U       // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO41        0x200U       // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO42        0x400U       // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO43        0x800U       // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO44        0x1000U      // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO45        0x2000U      // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO46        0x4000U      // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO47        0x8000U      // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO48        0x10000U     // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO49        0x20000U     // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO50        0x40000U     // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO51        0x80000U     // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO52        0x100000U    // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO53        0x200000U    // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO54        0x400000U    // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO55        0x800000U    // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO56        0x1000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO57        0x2000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO58        0x4000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO59        0x8000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO60        0x10000000U  // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO61        0x20000000U  // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO62        0x40000000U  // Input inversion control for
                                               // this pin
#define GPIO_GPBINV_GPIO63        0x80000000U  // Input inversion control for
                                               // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBODR register
//
//*****************************************************************************
#define GPIO_GPBODR_GPIO32        0x1U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO33        0x2U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO34        0x4U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO35        0x8U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO36        0x10U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO37        0x20U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO38        0x40U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO39        0x80U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO40        0x100U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO41        0x200U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO42        0x400U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO43        0x800U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO44        0x1000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO45        0x2000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO46        0x4000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO47        0x8000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO48        0x10000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO49        0x20000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO50        0x40000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO51        0x80000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO52        0x100000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO53        0x200000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO54        0x400000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO55        0x800000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO56        0x1000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO57        0x2000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO58        0x4000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO59        0x8000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO60        0x10000000U  // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO61        0x20000000U  // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO62        0x40000000U  // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPBODR_GPIO63        0x80000000U  // Outpout Open-Drain control
                                               // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBAMSEL register
//
//*****************************************************************************
#define GPIO_GPBAMSEL_GPIO42      0x400U       // Analog Mode select for this
                                               // pin
#define GPIO_GPBAMSEL_GPIO43      0x800U       // Analog Mode select for this
                                               // pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBGMUX1 register
//
//*****************************************************************************
#define GPIO_GPBGMUX1_GPIO32_S    0U
#define GPIO_GPBGMUX1_GPIO32_M    0x3U         // Defines pin-muxing selection
                                               // for GPIO32
#define GPIO_GPBGMUX1_GPIO33_S    2U
#define GPIO_GPBGMUX1_GPIO33_M    0xCU         // Defines pin-muxing selection
                                               // for GPIO33
#define GPIO_GPBGMUX1_GPIO34_S    4U
#define GPIO_GPBGMUX1_GPIO34_M    0x30U        // Defines pin-muxing selection
                                               // for GPIO34
#define GPIO_GPBGMUX1_GPIO35_S    6U
#define GPIO_GPBGMUX1_GPIO35_M    0xC0U        // Defines pin-muxing selection
                                               // for GPIO35
#define GPIO_GPBGMUX1_GPIO36_S    8U
#define GPIO_GPBGMUX1_GPIO36_M    0x300U       // Defines pin-muxing selection
                                               // for GPIO36
#define GPIO_GPBGMUX1_GPIO37_S    10U
#define GPIO_GPBGMUX1_GPIO37_M    0xC00U       // Defines pin-muxing selection
                                               // for GPIO37
#define GPIO_GPBGMUX1_GPIO38_S    12U
#define GPIO_GPBGMUX1_GPIO38_M    0x3000U      // Defines pin-muxing selection
                                               // for GPIO38
#define GPIO_GPBGMUX1_GPIO39_S    14U
#define GPIO_GPBGMUX1_GPIO39_M    0xC000U      // Defines pin-muxing selection
                                               // for GPIO39
#define GPIO_GPBGMUX1_GPIO40_S    16U
#define GPIO_GPBGMUX1_GPIO40_M    0x30000U     // Defines pin-muxing selection
                                               // for GPIO40
#define GPIO_GPBGMUX1_GPIO41_S    18U
#define GPIO_GPBGMUX1_GPIO41_M    0xC0000U     // Defines pin-muxing selection
                                               // for GPIO41
#define GPIO_GPBGMUX1_GPIO42_S    20U
#define GPIO_GPBGMUX1_GPIO42_M    0x300000U    // Defines pin-muxing selection
                                               // for GPIO42
#define GPIO_GPBGMUX1_GPIO43_S    22U
#define GPIO_GPBGMUX1_GPIO43_M    0xC00000U    // Defines pin-muxing selection
                                               // for GPIO43
#define GPIO_GPBGMUX1_GPIO44_S    24U
#define GPIO_GPBGMUX1_GPIO44_M    0x3000000U   // Defines pin-muxing selection
                                               // for GPIO44
#define GPIO_GPBGMUX1_GPIO45_S    26U
#define GPIO_GPBGMUX1_GPIO45_M    0xC000000U   // Defines pin-muxing selection
                                               // for GPIO45
#define GPIO_GPBGMUX1_GPIO46_S    28U
#define GPIO_GPBGMUX1_GPIO46_M    0x30000000U  // Defines pin-muxing selection
                                               // for GPIO46
#define GPIO_GPBGMUX1_GPIO47_S    30U
#define GPIO_GPBGMUX1_GPIO47_M    0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO47

