tdloe/tms320-rpi-serial/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPBGMUX2 register
//
//*****************************************************************************
#define GPIO_GPBGMUX2_GPIO48_S    0U
#define GPIO_GPBGMUX2_GPIO48_M    0x3U         // Defines pin-muxing selection
                                               // for GPIO48
#define GPIO_GPBGMUX2_GPIO49_S    2U
#define GPIO_GPBGMUX2_GPIO49_M    0xCU         // Defines pin-muxing selection
                                               // for GPIO49
#define GPIO_GPBGMUX2_GPIO50_S    4U
#define GPIO_GPBGMUX2_GPIO50_M    0x30U        // Defines pin-muxing selection
                                               // for GPIO50
#define GPIO_GPBGMUX2_GPIO51_S    6U
#define GPIO_GPBGMUX2_GPIO51_M    0xC0U        // Defines pin-muxing selection
                                               // for GPIO51
#define GPIO_GPBGMUX2_GPIO52_S    8U
#define GPIO_GPBGMUX2_GPIO52_M    0x300U       // Defines pin-muxing selection
                                               // for GPIO52
#define GPIO_GPBGMUX2_GPIO53_S    10U
#define GPIO_GPBGMUX2_GPIO53_M    0xC00U       // Defines pin-muxing selection
                                               // for GPIO53
#define GPIO_GPBGMUX2_GPIO54_S    12U
#define GPIO_GPBGMUX2_GPIO54_M    0x3000U      // Defines pin-muxing selection
                                               // for GPIO54
#define GPIO_GPBGMUX2_GPIO55_S    14U
#define GPIO_GPBGMUX2_GPIO55_M    0xC000U      // Defines pin-muxing selection
                                               // for GPIO55
#define GPIO_GPBGMUX2_GPIO56_S    16U
#define GPIO_GPBGMUX2_GPIO56_M    0x30000U     // Defines pin-muxing selection
                                               // for GPIO56
#define GPIO_GPBGMUX2_GPIO57_S    18U
#define GPIO_GPBGMUX2_GPIO57_M    0xC0000U     // Defines pin-muxing selection
                                               // for GPIO57
#define GPIO_GPBGMUX2_GPIO58_S    20U
#define GPIO_GPBGMUX2_GPIO58_M    0x300000U    // Defines pin-muxing selection
                                               // for GPIO58
#define GPIO_GPBGMUX2_GPIO59_S    22U
#define GPIO_GPBGMUX2_GPIO59_M    0xC00000U    // Defines pin-muxing selection
                                               // for GPIO59
#define GPIO_GPBGMUX2_GPIO60_S    24U
#define GPIO_GPBGMUX2_GPIO60_M    0x3000000U   // Defines pin-muxing selection
                                               // for GPIO60
#define GPIO_GPBGMUX2_GPIO61_S    26U
#define GPIO_GPBGMUX2_GPIO61_M    0xC000000U   // Defines pin-muxing selection
                                               // for GPIO61
#define GPIO_GPBGMUX2_GPIO62_S    28U
#define GPIO_GPBGMUX2_GPIO62_M    0x30000000U  // Defines pin-muxing selection
                                               // for GPIO62
#define GPIO_GPBGMUX2_GPIO63_S    30U
#define GPIO_GPBGMUX2_GPIO63_M    0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO63

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL1 register
//
//*****************************************************************************
#define GPIO_GPBCSEL1_GPIO32_S    0U
#define GPIO_GPBCSEL1_GPIO32_M    0xFU         // GPIO32 Master CPU Select
#define GPIO_GPBCSEL1_GPIO33_S    4U
#define GPIO_GPBCSEL1_GPIO33_M    0xF0U        // GPIO33 Master CPU Select
#define GPIO_GPBCSEL1_GPIO34_S    8U
#define GPIO_GPBCSEL1_GPIO34_M    0xF00U       // GPIO34 Master CPU Select
#define GPIO_GPBCSEL1_GPIO35_S    12U
#define GPIO_GPBCSEL1_GPIO35_M    0xF000U      // GPIO35 Master CPU Select
#define GPIO_GPBCSEL1_GPIO36_S    16U
#define GPIO_GPBCSEL1_GPIO36_M    0xF0000U     // GPIO36 Master CPU Select
#define GPIO_GPBCSEL1_GPIO37_S    20U
#define GPIO_GPBCSEL1_GPIO37_M    0xF00000U    // GPIO37 Master CPU Select
#define GPIO_GPBCSEL1_GPIO38_S    24U
#define GPIO_GPBCSEL1_GPIO38_M    0xF000000U   // GPIO38 Master CPU Select
#define GPIO_GPBCSEL1_GPIO39_S    28U
#define GPIO_GPBCSEL1_GPIO39_M    0xF0000000U  // GPIO39 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL2 register
//
//*****************************************************************************
#define GPIO_GPBCSEL2_GPIO40_S    0U
#define GPIO_GPBCSEL2_GPIO40_M    0xFU         // GPIO40 Master CPU Select
#define GPIO_GPBCSEL2_GPIO41_S    4U
#define GPIO_GPBCSEL2_GPIO41_M    0xF0U        // GPIO41 Master CPU Select
#define GPIO_GPBCSEL2_GPIO42_S    8U
#define GPIO_GPBCSEL2_GPIO42_M    0xF00U       // GPIO42 Master CPU Select
#define GPIO_GPBCSEL2_GPIO43_S    12U
#define GPIO_GPBCSEL2_GPIO43_M    0xF000U      // GPIO43 Master CPU Select
#define GPIO_GPBCSEL2_GPIO44_S    16U
#define GPIO_GPBCSEL2_GPIO44_M    0xF0000U     // GPIO44 Master CPU Select
#define GPIO_GPBCSEL2_GPIO45_S    20U
#define GPIO_GPBCSEL2_GPIO45_M    0xF00000U    // GPIO45 Master CPU Select
#define GPIO_GPBCSEL2_GPIO46_S    24U
#define GPIO_GPBCSEL2_GPIO46_M    0xF000000U   // GPIO46 Master CPU Select
#define GPIO_GPBCSEL2_GPIO47_S    28U
#define GPIO_GPBCSEL2_GPIO47_M    0xF0000000U  // GPIO47 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL3 register
//
//*****************************************************************************
#define GPIO_GPBCSEL3_GPIO48_S    0U
#define GPIO_GPBCSEL3_GPIO48_M    0xFU         // GPIO48 Master CPU Select
#define GPIO_GPBCSEL3_GPIO49_S    4U
#define GPIO_GPBCSEL3_GPIO49_M    0xF0U        // GPIO49 Master CPU Select
#define GPIO_GPBCSEL3_GPIO50_S    8U
#define GPIO_GPBCSEL3_GPIO50_M    0xF00U       // GPIO50 Master CPU Select
#define GPIO_GPBCSEL3_GPIO51_S    12U
#define GPIO_GPBCSEL3_GPIO51_M    0xF000U      // GPIO51 Master CPU Select
#define GPIO_GPBCSEL3_GPIO52_S    16U
#define GPIO_GPBCSEL3_GPIO52_M    0xF0000U     // GPIO52 Master CPU Select
#define GPIO_GPBCSEL3_GPIO53_S    20U
#define GPIO_GPBCSEL3_GPIO53_M    0xF00000U    // GPIO53 Master CPU Select
#define GPIO_GPBCSEL3_GPIO54_S    24U
#define GPIO_GPBCSEL3_GPIO54_M    0xF000000U   // GPIO54 Master CPU Select
#define GPIO_GPBCSEL3_GPIO55_S    28U
#define GPIO_GPBCSEL3_GPIO55_M    0xF0000000U  // GPIO55 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL4 register
//
//*****************************************************************************
#define GPIO_GPBCSEL4_GPIO56_S    0U
#define GPIO_GPBCSEL4_GPIO56_M    0xFU         // GPIO56 Master CPU Select
#define GPIO_GPBCSEL4_GPIO57_S    4U
#define GPIO_GPBCSEL4_GPIO57_M    0xF0U        // GPIO57 Master CPU Select
#define GPIO_GPBCSEL4_GPIO58_S    8U
#define GPIO_GPBCSEL4_GPIO58_M    0xF00U       // GPIO58 Master CPU Select
#define GPIO_GPBCSEL4_GPIO59_S    12U
#define GPIO_GPBCSEL4_GPIO59_M    0xF000U      // GPIO59 Master CPU Select
#define GPIO_GPBCSEL4_GPIO60_S    16U
#define GPIO_GPBCSEL4_GPIO60_M    0xF0000U     // GPIO60 Master CPU Select
#define GPIO_GPBCSEL4_GPIO61_S    20U
#define GPIO_GPBCSEL4_GPIO61_M    0xF00000U    // GPIO61 Master CPU Select
#define GPIO_GPBCSEL4_GPIO62_S    24U
#define GPIO_GPBCSEL4_GPIO62_M    0xF000000U   // GPIO62 Master CPU Select
#define GPIO_GPBCSEL4_GPIO63_S    28U
#define GPIO_GPBCSEL4_GPIO63_M    0xF0000000U  // GPIO63 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBLOCK register
//
//*****************************************************************************
#define GPIO_GPBLOCK_GPIO32       0x1U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO33       0x2U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO34       0x4U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO35       0x8U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO36       0x10U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO37       0x20U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO38       0x40U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO39       0x80U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO40       0x100U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO41       0x200U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO42       0x400U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO43       0x800U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO44       0x1000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO45       0x2000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO46       0x4000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO47       0x8000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO48       0x10000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO49       0x20000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO50       0x40000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO51       0x80000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO52       0x100000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO53       0x200000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO54       0x400000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO55       0x800000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO56       0x1000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO57       0x2000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO58       0x4000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO59       0x8000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO60       0x10000000U  // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO61       0x20000000U  // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO62       0x40000000U  // Configuration Lock bit for
                                               // this pin
#define GPIO_GPBLOCK_GPIO63       0x80000000U  // Configuration Lock bit for
                                               // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCR register
//
//*****************************************************************************
#define GPIO_GPBCR_GPIO32         0x1U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO33         0x2U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO34         0x4U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO35         0x8U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO36         0x10U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO37         0x20U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO38         0x40U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO39         0x80U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO40         0x100U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO41         0x200U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO42         0x400U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO43         0x800U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO44         0x1000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO45         0x2000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO46         0x4000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO47         0x8000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO48         0x10000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO49         0x20000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO50         0x40000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO51         0x80000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO52         0x100000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO53         0x200000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO54         0x400000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO55         0x800000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO56         0x1000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO57         0x2000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO58         0x4000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO59         0x8000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO60         0x10000000U  // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO61         0x20000000U  // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO62         0x40000000U  // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPBCR_GPIO63         0x80000000U  // Configuration lock commit bit
                                               // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCCTRL register
//
//*****************************************************************************
#define GPIO_GPCCTRL_QUALPRD0_S   0U
#define GPIO_GPCCTRL_QUALPRD0_M   0xFFU        // Qualification sampling period
                                               // for GPIO64 to GPIO71
#define GPIO_GPCCTRL_QUALPRD1_S   8U
#define GPIO_GPCCTRL_QUALPRD1_M   0xFF00U      // Qualification sampling period
                                               // for GPIO72 to GPIO79
#define GPIO_GPCCTRL_QUALPRD2_S   16U
#define GPIO_GPCCTRL_QUALPRD2_M   0xFF0000U    // Qualification sampling period
                                               // for GPIO80 to GPIO87
#define GPIO_GPCCTRL_QUALPRD3_S   24U
#define GPIO_GPCCTRL_QUALPRD3_M   0xFF000000U  // Qualification sampling period
                                               // for GPIO88 to GPIO95

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCQSEL1 register
//
//*****************************************************************************
#define GPIO_GPCQSEL1_GPIO64_S    0U
#define GPIO_GPCQSEL1_GPIO64_M    0x3U         // Select input qualification
                                               // type for GPIO64
#define GPIO_GPCQSEL1_GPIO65_S    2U
#define GPIO_GPCQSEL1_GPIO65_M    0xCU         // Select input qualification
                                               // type for GPIO65
#define GPIO_GPCQSEL1_GPIO66_S    4U
#define GPIO_GPCQSEL1_GPIO66_M    0x30U        // Select input qualification
                                               // type for GPIO66
#define GPIO_GPCQSEL1_GPIO67_S    6U
#define GPIO_GPCQSEL1_GPIO67_M    0xC0U        // Select input qualification
                                               // type for GPIO67
#define GPIO_GPCQSEL1_GPIO68_S    8U
#define GPIO_GPCQSEL1_GPIO68_M    0x300U       // Select input qualification
                                               // type for GPIO68
#define GPIO_GPCQSEL1_GPIO69_S    10U
#define GPIO_GPCQSEL1_GPIO69_M    0xC00U       // Select input qualification
                                               // type for GPIO69
#define GPIO_GPCQSEL1_GPIO70_S    12U
#define GPIO_GPCQSEL1_GPIO70_M    0x3000U      // Select input qualification
                                               // type for GPIO70
#define GPIO_GPCQSEL1_GPIO71_S    14U
#define GPIO_GPCQSEL1_GPIO71_M    0xC000U      // Select input qualification
                                               // type for GPIO71
#define GPIO_GPCQSEL1_GPIO72_S    16U
#define GPIO_GPCQSEL1_GPIO72_M    0x30000U     // Select input qualification
                                               // type for GPIO72
#define GPIO_GPCQSEL1_GPIO73_S    18U
#define GPIO_GPCQSEL1_GPIO73_M    0xC0000U     // Select input qualification
                                               // type for GPIO73
#define GPIO_GPCQSEL1_GPIO74_S    20U
#define GPIO_GPCQSEL1_GPIO74_M    0x300000U    // Select input qualification
                                               // type for GPIO74
#define GPIO_GPCQSEL1_GPIO75_S    22U
#define GPIO_GPCQSEL1_GPIO75_M    0xC00000U    // Select input qualification
                                               // type for GPIO75
#define GPIO_GPCQSEL1_GPIO76_S    24U
#define GPIO_GPCQSEL1_GPIO76_M    0x3000000U   // Select input qualification
                                               // type for GPIO76
#define GPIO_GPCQSEL1_GPIO77_S    26U
#define GPIO_GPCQSEL1_GPIO77_M    0xC000000U   // Select input qualification
                                               // type for GPIO77
#define GPIO_GPCQSEL1_GPIO78_S    28U
#define GPIO_GPCQSEL1_GPIO78_M    0x30000000U  // Select input qualification
                                               // type for GPIO78
#define GPIO_GPCQSEL1_GPIO79_S    30U
#define GPIO_GPCQSEL1_GPIO79_M    0xC0000000U  // Select input qualification
                                               // type for GPIO79

