tdloe/tms320-rpi-serial/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPCCR register
//
//*****************************************************************************
#define GPIO_GPCCR_GPIO64         0x1U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO65         0x2U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO66         0x4U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO67         0x8U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO68         0x10U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO69         0x20U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO70         0x40U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO71         0x80U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO72         0x100U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO73         0x200U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO74         0x400U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO75         0x800U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO76         0x1000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO77         0x2000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO78         0x4000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO79         0x8000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO80         0x10000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO81         0x20000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO82         0x40000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO83         0x80000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO84         0x100000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO85         0x200000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO86         0x400000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO87         0x800000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO88         0x1000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO89         0x2000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO90         0x4000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO91         0x8000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO92         0x10000000U  // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO93         0x20000000U  // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO94         0x40000000U  // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPCCR_GPIO95         0x80000000U  // Configuration lock commit bit
                                               // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDCTRL register
//
//*****************************************************************************
#define GPIO_GPDCTRL_QUALPRD0_S   0U
#define GPIO_GPDCTRL_QUALPRD0_M   0xFFU        // Qualification sampling period
                                               // for GPIO96 to GPIO103
#define GPIO_GPDCTRL_QUALPRD1_S   8U
#define GPIO_GPDCTRL_QUALPRD1_M   0xFF00U      // Qualification sampling period
                                               // for GPIO104 to GPIO111
#define GPIO_GPDCTRL_QUALPRD2_S   16U
#define GPIO_GPDCTRL_QUALPRD2_M   0xFF0000U    // Qualification sampling period
                                               // for GPIO112 to GPIO119
#define GPIO_GPDCTRL_QUALPRD3_S   24U
#define GPIO_GPDCTRL_QUALPRD3_M   0xFF000000U  // Qualification sampling period
                                               // for GPIO120 to GPIO127

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDQSEL1 register
//
//*****************************************************************************
#define GPIO_GPDQSEL1_GPIO96_S    0U
#define GPIO_GPDQSEL1_GPIO96_M    0x3U         // Select input qualification
                                               // type for GPIO96
#define GPIO_GPDQSEL1_GPIO97_S    2U
#define GPIO_GPDQSEL1_GPIO97_M    0xCU         // Select input qualification
                                               // type for GPIO97
#define GPIO_GPDQSEL1_GPIO98_S    4U
#define GPIO_GPDQSEL1_GPIO98_M    0x30U        // Select input qualification
                                               // type for GPIO98
#define GPIO_GPDQSEL1_GPIO99_S    6U
#define GPIO_GPDQSEL1_GPIO99_M    0xC0U        // Select input qualification
                                               // type for GPIO99
#define GPIO_GPDQSEL1_GPIO100_S   8U
#define GPIO_GPDQSEL1_GPIO100_M   0x300U       // Select input qualification
                                               // type for GPIO100
#define GPIO_GPDQSEL1_GPIO101_S   10U
#define GPIO_GPDQSEL1_GPIO101_M   0xC00U       // Select input qualification
                                               // type for GPIO101
#define GPIO_GPDQSEL1_GPIO102_S   12U
#define GPIO_GPDQSEL1_GPIO102_M   0x3000U      // Select input qualification
                                               // type for GPIO102
#define GPIO_GPDQSEL1_GPIO103_S   14U
#define GPIO_GPDQSEL1_GPIO103_M   0xC000U      // Select input qualification
                                               // type for GPIO103
#define GPIO_GPDQSEL1_GPIO104_S   16U
#define GPIO_GPDQSEL1_GPIO104_M   0x30000U     // Select input qualification
                                               // type for GPIO104
#define GPIO_GPDQSEL1_GPIO105_S   18U
#define GPIO_GPDQSEL1_GPIO105_M   0xC0000U     // Select input qualification
                                               // type for GPIO105
#define GPIO_GPDQSEL1_GPIO106_S   20U
#define GPIO_GPDQSEL1_GPIO106_M   0x300000U    // Select input qualification
                                               // type for GPIO106
#define GPIO_GPDQSEL1_GPIO107_S   22U
#define GPIO_GPDQSEL1_GPIO107_M   0xC00000U    // Select input qualification
                                               // type for GPIO107
#define GPIO_GPDQSEL1_GPIO108_S   24U
#define GPIO_GPDQSEL1_GPIO108_M   0x3000000U   // Select input qualification
                                               // type for GPIO108
#define GPIO_GPDQSEL1_GPIO109_S   26U
#define GPIO_GPDQSEL1_GPIO109_M   0xC000000U   // Select input qualification
                                               // type for GPIO109
#define GPIO_GPDQSEL1_GPIO110_S   28U
#define GPIO_GPDQSEL1_GPIO110_M   0x30000000U  // Select input qualification
                                               // type for GPIO110
#define GPIO_GPDQSEL1_GPIO111_S   30U
#define GPIO_GPDQSEL1_GPIO111_M   0xC0000000U  // Select input qualification
                                               // type for GPIO111

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDQSEL2 register
//
//*****************************************************************************
#define GPIO_GPDQSEL2_GPIO112_S   0U
#define GPIO_GPDQSEL2_GPIO112_M   0x3U         // Select input qualification
                                               // type for GPIO112
#define GPIO_GPDQSEL2_GPIO113_S   2U
#define GPIO_GPDQSEL2_GPIO113_M   0xCU         // Select input qualification
                                               // type for GPIO113
#define GPIO_GPDQSEL2_GPIO114_S   4U
#define GPIO_GPDQSEL2_GPIO114_M   0x30U        // Select input qualification
                                               // type for GPIO114
#define GPIO_GPDQSEL2_GPIO115_S   6U
#define GPIO_GPDQSEL2_GPIO115_M   0xC0U        // Select input qualification
                                               // type for GPIO115
#define GPIO_GPDQSEL2_GPIO116_S   8U
#define GPIO_GPDQSEL2_GPIO116_M   0x300U       // Select input qualification
                                               // type for GPIO116
#define GPIO_GPDQSEL2_GPIO117_S   10U
#define GPIO_GPDQSEL2_GPIO117_M   0xC00U       // Select input qualification
                                               // type for GPIO117
#define GPIO_GPDQSEL2_GPIO118_S   12U
#define GPIO_GPDQSEL2_GPIO118_M   0x3000U      // Select input qualification
                                               // type for GPIO118
#define GPIO_GPDQSEL2_GPIO119_S   14U
#define GPIO_GPDQSEL2_GPIO119_M   0xC000U      // Select input qualification
                                               // type for GPIO119
#define GPIO_GPDQSEL2_GPIO120_S   16U
#define GPIO_GPDQSEL2_GPIO120_M   0x30000U     // Select input qualification
                                               // type for GPIO120
#define GPIO_GPDQSEL2_GPIO121_S   18U
#define GPIO_GPDQSEL2_GPIO121_M   0xC0000U     // Select input qualification
                                               // type for GPIO121
#define GPIO_GPDQSEL2_GPIO122_S   20U
#define GPIO_GPDQSEL2_GPIO122_M   0x300000U    // Select input qualification
                                               // type for GPIO122
#define GPIO_GPDQSEL2_GPIO123_S   22U
#define GPIO_GPDQSEL2_GPIO123_M   0xC00000U    // Select input qualification
                                               // type for GPIO123
#define GPIO_GPDQSEL2_GPIO124_S   24U
#define GPIO_GPDQSEL2_GPIO124_M   0x3000000U   // Select input qualification
                                               // type for GPIO124
#define GPIO_GPDQSEL2_GPIO125_S   26U
#define GPIO_GPDQSEL2_GPIO125_M   0xC000000U   // Select input qualification
                                               // type for GPIO125
#define GPIO_GPDQSEL2_GPIO126_S   28U
#define GPIO_GPDQSEL2_GPIO126_M   0x30000000U  // Select input qualification
                                               // type for GPIO126
#define GPIO_GPDQSEL2_GPIO127_S   30U
#define GPIO_GPDQSEL2_GPIO127_M   0xC0000000U  // Select input qualification
                                               // type for GPIO127

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDMUX1 register
//
//*****************************************************************************
#define GPIO_GPDMUX1_GPIO96_S     0U
#define GPIO_GPDMUX1_GPIO96_M     0x3U         // Defines pin-muxing selection
                                               // for GPIO96
#define GPIO_GPDMUX1_GPIO97_S     2U
#define GPIO_GPDMUX1_GPIO97_M     0xCU         // Defines pin-muxing selection
                                               // for GPIO97
#define GPIO_GPDMUX1_GPIO98_S     4U
#define GPIO_GPDMUX1_GPIO98_M     0x30U        // Defines pin-muxing selection
                                               // for GPIO98
#define GPIO_GPDMUX1_GPIO99_S     6U
#define GPIO_GPDMUX1_GPIO99_M     0xC0U        // Defines pin-muxing selection
                                               // for GPIO99
#define GPIO_GPDMUX1_GPIO100_S    8U
#define GPIO_GPDMUX1_GPIO100_M    0x300U       // Defines pin-muxing selection
                                               // for GPIO100
#define GPIO_GPDMUX1_GPIO101_S    10U
#define GPIO_GPDMUX1_GPIO101_M    0xC00U       // Defines pin-muxing selection
                                               // for GPIO101
#define GPIO_GPDMUX1_GPIO102_S    12U
#define GPIO_GPDMUX1_GPIO102_M    0x3000U      // Defines pin-muxing selection
                                               // for GPIO102
#define GPIO_GPDMUX1_GPIO103_S    14U
#define GPIO_GPDMUX1_GPIO103_M    0xC000U      // Defines pin-muxing selection
                                               // for GPIO103
#define GPIO_GPDMUX1_GPIO104_S    16U
#define GPIO_GPDMUX1_GPIO104_M    0x30000U     // Defines pin-muxing selection
                                               // for GPIO104
#define GPIO_GPDMUX1_GPIO105_S    18U
#define GPIO_GPDMUX1_GPIO105_M    0xC0000U     // Defines pin-muxing selection
                                               // for GPIO105
#define GPIO_GPDMUX1_GPIO106_S    20U
#define GPIO_GPDMUX1_GPIO106_M    0x300000U    // Defines pin-muxing selection
                                               // for GPIO106
#define GPIO_GPDMUX1_GPIO107_S    22U
#define GPIO_GPDMUX1_GPIO107_M    0xC00000U    // Defines pin-muxing selection
                                               // for GPIO107
#define GPIO_GPDMUX1_GPIO108_S    24U
#define GPIO_GPDMUX1_GPIO108_M    0x3000000U   // Defines pin-muxing selection
                                               // for GPIO108
#define GPIO_GPDMUX1_GPIO109_S    26U
#define GPIO_GPDMUX1_GPIO109_M    0xC000000U   // Defines pin-muxing selection
                                               // for GPIO109
#define GPIO_GPDMUX1_GPIO110_S    28U
#define GPIO_GPDMUX1_GPIO110_M    0x30000000U  // Defines pin-muxing selection
                                               // for GPIO110
#define GPIO_GPDMUX1_GPIO111_S    30U
#define GPIO_GPDMUX1_GPIO111_M    0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO111

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDMUX2 register
//
//*****************************************************************************
#define GPIO_GPDMUX2_GPIO112_S    0U
#define GPIO_GPDMUX2_GPIO112_M    0x3U         // Defines pin-muxing selection
                                               // for GPIO112
#define GPIO_GPDMUX2_GPIO113_S    2U
#define GPIO_GPDMUX2_GPIO113_M    0xCU         // Defines pin-muxing selection
                                               // for GPIO113
#define GPIO_GPDMUX2_GPIO114_S    4U
#define GPIO_GPDMUX2_GPIO114_M    0x30U        // Defines pin-muxing selection
                                               // for GPIO114
#define GPIO_GPDMUX2_GPIO115_S    6U
#define GPIO_GPDMUX2_GPIO115_M    0xC0U        // Defines pin-muxing selection
                                               // for GPIO115
#define GPIO_GPDMUX2_GPIO116_S    8U
#define GPIO_GPDMUX2_GPIO116_M    0x300U       // Defines pin-muxing selection
                                               // for GPIO116
#define GPIO_GPDMUX2_GPIO117_S    10U
#define GPIO_GPDMUX2_GPIO117_M    0xC00U       // Defines pin-muxing selection
                                               // for GPIO117
#define GPIO_GPDMUX2_GPIO118_S    12U
#define GPIO_GPDMUX2_GPIO118_M    0x3000U      // Defines pin-muxing selection
                                               // for GPIO118
#define GPIO_GPDMUX2_GPIO119_S    14U
#define GPIO_GPDMUX2_GPIO119_M    0xC000U      // Defines pin-muxing selection
                                               // for GPIO119
#define GPIO_GPDMUX2_GPIO120_S    16U
#define GPIO_GPDMUX2_GPIO120_M    0x30000U     // Defines pin-muxing selection
                                               // for GPIO120
#define GPIO_GPDMUX2_GPIO121_S    18U
#define GPIO_GPDMUX2_GPIO121_M    0xC0000U     // Defines pin-muxing selection
                                               // for GPIO121
#define GPIO_GPDMUX2_GPIO122_S    20U
#define GPIO_GPDMUX2_GPIO122_M    0x300000U    // Defines pin-muxing selection
                                               // for GPIO122
#define GPIO_GPDMUX2_GPIO123_S    22U
#define GPIO_GPDMUX2_GPIO123_M    0xC00000U    // Defines pin-muxing selection
                                               // for GPIO123
#define GPIO_GPDMUX2_GPIO124_S    24U
#define GPIO_GPDMUX2_GPIO124_M    0x3000000U   // Defines pin-muxing selection
                                               // for GPIO124
#define GPIO_GPDMUX2_GPIO125_S    26U
#define GPIO_GPDMUX2_GPIO125_M    0xC000000U   // Defines pin-muxing selection
                                               // for GPIO125
#define GPIO_GPDMUX2_GPIO126_S    28U
#define GPIO_GPDMUX2_GPIO126_M    0x30000000U  // Defines pin-muxing selection
                                               // for GPIO126
#define GPIO_GPDMUX2_GPIO127_S    30U
#define GPIO_GPDMUX2_GPIO127_M    0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO127

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDDIR register
//
//*****************************************************************************
#define GPIO_GPDDIR_GPIO96        0x1U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO97        0x2U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO98        0x4U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO99        0x8U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO100       0x10U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO101       0x20U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO102       0x40U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO103       0x80U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO104       0x100U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO105       0x200U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO106       0x400U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO107       0x800U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO108       0x1000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO109       0x2000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO110       0x4000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO111       0x8000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO112       0x10000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO113       0x20000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO114       0x40000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO115       0x80000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO116       0x100000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO117       0x200000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO118       0x400000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO119       0x800000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO120       0x1000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO121       0x2000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO122       0x4000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO123       0x8000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO124       0x10000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO125       0x20000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO126       0x40000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPDDIR_GPIO127       0x80000000U  // Defines direction for this
                                               // pin in GPIO mode

