tdloe/tms320-rpi-serial/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPDPUD register
//
//*****************************************************************************
#define GPIO_GPDPUD_GPIO96        0x1U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO97        0x2U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO98        0x4U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO99        0x8U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO100       0x10U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO101       0x20U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO102       0x40U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO103       0x80U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO104       0x100U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO105       0x200U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO106       0x400U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO107       0x800U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO108       0x1000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO109       0x2000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO110       0x4000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO111       0x8000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO112       0x10000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO113       0x20000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO114       0x40000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO115       0x80000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO116       0x100000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO117       0x200000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO118       0x400000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO119       0x800000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO120       0x1000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO121       0x2000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO122       0x4000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO123       0x8000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO124       0x10000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO125       0x20000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO126       0x40000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPDPUD_GPIO127       0x80000000U  // Pull-Up Disable control for
                                               // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDINV register
//
//*****************************************************************************
#define GPIO_GPDINV_GPIO96        0x1U         // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO97        0x2U         // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO98        0x4U         // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO99        0x8U         // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO100       0x10U        // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO101       0x20U        // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO102       0x40U        // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO103       0x80U        // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO104       0x100U       // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO105       0x200U       // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO106       0x400U       // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO107       0x800U       // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO108       0x1000U      // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO109       0x2000U      // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO110       0x4000U      // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO111       0x8000U      // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO112       0x10000U     // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO113       0x20000U     // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO114       0x40000U     // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO115       0x80000U     // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO116       0x100000U    // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO117       0x200000U    // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO118       0x400000U    // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO119       0x800000U    // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO120       0x1000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO121       0x2000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO122       0x4000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO123       0x8000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO124       0x10000000U  // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO125       0x20000000U  // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO126       0x40000000U  // Input inversion control for
                                               // this pin
#define GPIO_GPDINV_GPIO127       0x80000000U  // Input inversion control for
                                               // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDODR register
//
//*****************************************************************************
#define GPIO_GPDODR_GPIO96        0x1U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO97        0x2U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO98        0x4U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO99        0x8U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO100       0x10U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO101       0x20U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO102       0x40U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO103       0x80U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO104       0x100U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO105       0x200U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO106       0x400U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO107       0x800U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO108       0x1000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO109       0x2000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO110       0x4000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO111       0x8000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO112       0x10000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO113       0x20000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO114       0x40000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO115       0x80000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO116       0x100000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO117       0x200000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO118       0x400000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO119       0x800000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO120       0x1000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO121       0x2000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO122       0x4000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO123       0x8000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO124       0x10000000U  // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO125       0x20000000U  // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO126       0x40000000U  // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPDODR_GPIO127       0x80000000U  // Outpout Open-Drain control
                                               // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDGMUX1 register
//
//*****************************************************************************
#define GPIO_GPDGMUX1_GPIO96_S    0U
#define GPIO_GPDGMUX1_GPIO96_M    0x3U         // Defines pin-muxing selection
                                               // for GPIO96
#define GPIO_GPDGMUX1_GPIO97_S    2U
#define GPIO_GPDGMUX1_GPIO97_M    0xCU         // Defines pin-muxing selection
                                               // for GPIO97
#define GPIO_GPDGMUX1_GPIO98_S    4U
#define GPIO_GPDGMUX1_GPIO98_M    0x30U        // Defines pin-muxing selection
                                               // for GPIO98
#define GPIO_GPDGMUX1_GPIO99_S    6U
#define GPIO_GPDGMUX1_GPIO99_M    0xC0U        // Defines pin-muxing selection
                                               // for GPIO99
#define GPIO_GPDGMUX1_GPIO100_S   8U
#define GPIO_GPDGMUX1_GPIO100_M   0x300U       // Defines pin-muxing selection
                                               // for GPIO100
#define GPIO_GPDGMUX1_GPIO101_S   10U
#define GPIO_GPDGMUX1_GPIO101_M   0xC00U       // Defines pin-muxing selection
                                               // for GPIO101
#define GPIO_GPDGMUX1_GPIO102_S   12U
#define GPIO_GPDGMUX1_GPIO102_M   0x3000U      // Defines pin-muxing selection
                                               // for GPIO102
#define GPIO_GPDGMUX1_GPIO103_S   14U
#define GPIO_GPDGMUX1_GPIO103_M   0xC000U      // Defines pin-muxing selection
                                               // for GPIO103
#define GPIO_GPDGMUX1_GPIO104_S   16U
#define GPIO_GPDGMUX1_GPIO104_M   0x30000U     // Defines pin-muxing selection
                                               // for GPIO104
#define GPIO_GPDGMUX1_GPIO105_S   18U
#define GPIO_GPDGMUX1_GPIO105_M   0xC0000U     // Defines pin-muxing selection
                                               // for GPIO105
#define GPIO_GPDGMUX1_GPIO106_S   20U
#define GPIO_GPDGMUX1_GPIO106_M   0x300000U    // Defines pin-muxing selection
                                               // for GPIO106
#define GPIO_GPDGMUX1_GPIO107_S   22U
#define GPIO_GPDGMUX1_GPIO107_M   0xC00000U    // Defines pin-muxing selection
                                               // for GPIO107
#define GPIO_GPDGMUX1_GPIO108_S   24U
#define GPIO_GPDGMUX1_GPIO108_M   0x3000000U   // Defines pin-muxing selection
                                               // for GPIO108
#define GPIO_GPDGMUX1_GPIO109_S   26U
#define GPIO_GPDGMUX1_GPIO109_M   0xC000000U   // Defines pin-muxing selection
                                               // for GPIO109
#define GPIO_GPDGMUX1_GPIO110_S   28U
#define GPIO_GPDGMUX1_GPIO110_M   0x30000000U  // Defines pin-muxing selection
                                               // for GPIO110
#define GPIO_GPDGMUX1_GPIO111_S   30U
#define GPIO_GPDGMUX1_GPIO111_M   0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO111

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDGMUX2 register
//
//*****************************************************************************
#define GPIO_GPDGMUX2_GPIO112_S   0U
#define GPIO_GPDGMUX2_GPIO112_M   0x3U         // Defines pin-muxing selection
                                               // for GPIO112
#define GPIO_GPDGMUX2_GPIO113_S   2U
#define GPIO_GPDGMUX2_GPIO113_M   0xCU         // Defines pin-muxing selection
                                               // for GPIO113
#define GPIO_GPDGMUX2_GPIO114_S   4U
#define GPIO_GPDGMUX2_GPIO114_M   0x30U        // Defines pin-muxing selection
                                               // for GPIO114
#define GPIO_GPDGMUX2_GPIO115_S   6U
#define GPIO_GPDGMUX2_GPIO115_M   0xC0U        // Defines pin-muxing selection
                                               // for GPIO115
#define GPIO_GPDGMUX2_GPIO116_S   8U
#define GPIO_GPDGMUX2_GPIO116_M   0x300U       // Defines pin-muxing selection
                                               // for GPIO116
#define GPIO_GPDGMUX2_GPIO117_S   10U
#define GPIO_GPDGMUX2_GPIO117_M   0xC00U       // Defines pin-muxing selection
                                               // for GPIO117
#define GPIO_GPDGMUX2_GPIO118_S   12U
#define GPIO_GPDGMUX2_GPIO118_M   0x3000U      // Defines pin-muxing selection
                                               // for GPIO118
#define GPIO_GPDGMUX2_GPIO119_S   14U
#define GPIO_GPDGMUX2_GPIO119_M   0xC000U      // Defines pin-muxing selection
                                               // for GPIO119
#define GPIO_GPDGMUX2_GPIO120_S   16U
#define GPIO_GPDGMUX2_GPIO120_M   0x30000U     // Defines pin-muxing selection
                                               // for GPIO120
#define GPIO_GPDGMUX2_GPIO121_S   18U
#define GPIO_GPDGMUX2_GPIO121_M   0xC0000U     // Defines pin-muxing selection
                                               // for GPIO121
#define GPIO_GPDGMUX2_GPIO122_S   20U
#define GPIO_GPDGMUX2_GPIO122_M   0x300000U    // Defines pin-muxing selection
                                               // for GPIO122
#define GPIO_GPDGMUX2_GPIO123_S   22U
#define GPIO_GPDGMUX2_GPIO123_M   0xC00000U    // Defines pin-muxing selection
                                               // for GPIO123
#define GPIO_GPDGMUX2_GPIO124_S   24U
#define GPIO_GPDGMUX2_GPIO124_M   0x3000000U   // Defines pin-muxing selection
                                               // for GPIO124
#define GPIO_GPDGMUX2_GPIO125_S   26U
#define GPIO_GPDGMUX2_GPIO125_M   0xC000000U   // Defines pin-muxing selection
                                               // for GPIO125
#define GPIO_GPDGMUX2_GPIO126_S   28U
#define GPIO_GPDGMUX2_GPIO126_M   0x30000000U  // Defines pin-muxing selection
                                               // for GPIO126
#define GPIO_GPDGMUX2_GPIO127_S   30U
#define GPIO_GPDGMUX2_GPIO127_M   0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO127

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDCSEL1 register
//
//*****************************************************************************
#define GPIO_GPDCSEL1_GPIO96_S    0U
#define GPIO_GPDCSEL1_GPIO96_M    0xFU         // GPIO96 Master CPU Select
#define GPIO_GPDCSEL1_GPIO97_S    4U
#define GPIO_GPDCSEL1_GPIO97_M    0xF0U        // GPIO97 Master CPU Select
#define GPIO_GPDCSEL1_GPIO98_S    8U
#define GPIO_GPDCSEL1_GPIO98_M    0xF00U       // GPIO98 Master CPU Select
#define GPIO_GPDCSEL1_GPIO99_S    12U
#define GPIO_GPDCSEL1_GPIO99_M    0xF000U      // GPIO99 Master CPU Select
#define GPIO_GPDCSEL1_GPIO100_S   16U
#define GPIO_GPDCSEL1_GPIO100_M   0xF0000U     // GPIO100 Master CPU Select
#define GPIO_GPDCSEL1_GPIO101_S   20U
#define GPIO_GPDCSEL1_GPIO101_M   0xF00000U    // GPIO101 Master CPU Select
#define GPIO_GPDCSEL1_GPIO102_S   24U
#define GPIO_GPDCSEL1_GPIO102_M   0xF000000U   // GPIO102 Master CPU Select
#define GPIO_GPDCSEL1_GPIO103_S   28U
#define GPIO_GPDCSEL1_GPIO103_M   0xF0000000U  // GPIO103 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDCSEL2 register
//
//*****************************************************************************
#define GPIO_GPDCSEL2_GPIO104_S   0U
#define GPIO_GPDCSEL2_GPIO104_M   0xFU         // GPIO104 Master CPU Select
#define GPIO_GPDCSEL2_GPIO105_S   4U
#define GPIO_GPDCSEL2_GPIO105_M   0xF0U        // GPIO105 Master CPU Select
#define GPIO_GPDCSEL2_GPIO106_S   8U
#define GPIO_GPDCSEL2_GPIO106_M   0xF00U       // GPIO106 Master CPU Select
#define GPIO_GPDCSEL2_GPIO107_S   12U
#define GPIO_GPDCSEL2_GPIO107_M   0xF000U      // GPIO107 Master CPU Select
#define GPIO_GPDCSEL2_GPIO108_S   16U
#define GPIO_GPDCSEL2_GPIO108_M   0xF0000U     // GPIO108 Master CPU Select
#define GPIO_GPDCSEL2_GPIO109_S   20U
#define GPIO_GPDCSEL2_GPIO109_M   0xF00000U    // GPIO109 Master CPU Select
#define GPIO_GPDCSEL2_GPIO110_S   24U
#define GPIO_GPDCSEL2_GPIO110_M   0xF000000U   // GPIO110 Master CPU Select
#define GPIO_GPDCSEL2_GPIO111_S   28U
#define GPIO_GPDCSEL2_GPIO111_M   0xF0000000U  // GPIO111 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDCSEL3 register
//
//*****************************************************************************
#define GPIO_GPDCSEL3_GPIO112_S   0U
#define GPIO_GPDCSEL3_GPIO112_M   0xFU         // GPIO112 Master CPU Select
#define GPIO_GPDCSEL3_GPIO113_S   4U
#define GPIO_GPDCSEL3_GPIO113_M   0xF0U        // GPIO113 Master CPU Select
#define GPIO_GPDCSEL3_GPIO114_S   8U
#define GPIO_GPDCSEL3_GPIO114_M   0xF00U       // GPIO114 Master CPU Select
#define GPIO_GPDCSEL3_GPIO115_S   12U
#define GPIO_GPDCSEL3_GPIO115_M   0xF000U      // GPIO115 Master CPU Select
#define GPIO_GPDCSEL3_GPIO116_S   16U
#define GPIO_GPDCSEL3_GPIO116_M   0xF0000U     // GPIO116 Master CPU Select
#define GPIO_GPDCSEL3_GPIO117_S   20U
#define GPIO_GPDCSEL3_GPIO117_M   0xF00000U    // GPIO117 Master CPU Select
#define GPIO_GPDCSEL3_GPIO118_S   24U
#define GPIO_GPDCSEL3_GPIO118_M   0xF000000U   // GPIO118 Master CPU Select
#define GPIO_GPDCSEL3_GPIO119_S   28U
#define GPIO_GPDCSEL3_GPIO119_M   0xF0000000U  // GPIO119 Master CPU Select

