tdloe/tms320-rpi-serial/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPFMUX1 register
//
//*****************************************************************************
#define GPIO_GPFMUX1_GPIO160_S    0U
#define GPIO_GPFMUX1_GPIO160_M    0x3U         // Defines pin-muxing selection
                                               // for GPIO160
#define GPIO_GPFMUX1_GPIO161_S    2U
#define GPIO_GPFMUX1_GPIO161_M    0xCU         // Defines pin-muxing selection
                                               // for GPIO161
#define GPIO_GPFMUX1_GPIO162_S    4U
#define GPIO_GPFMUX1_GPIO162_M    0x30U        // Defines pin-muxing selection
                                               // for GPIO162
#define GPIO_GPFMUX1_GPIO163_S    6U
#define GPIO_GPFMUX1_GPIO163_M    0xC0U        // Defines pin-muxing selection
                                               // for GPIO163
#define GPIO_GPFMUX1_GPIO164_S    8U
#define GPIO_GPFMUX1_GPIO164_M    0x300U       // Defines pin-muxing selection
                                               // for GPIO164
#define GPIO_GPFMUX1_GPIO165_S    10U
#define GPIO_GPFMUX1_GPIO165_M    0xC00U       // Defines pin-muxing selection
                                               // for GPIO165
#define GPIO_GPFMUX1_GPIO166_S    12U
#define GPIO_GPFMUX1_GPIO166_M    0x3000U      // Defines pin-muxing selection
                                               // for GPIO166
#define GPIO_GPFMUX1_GPIO167_S    14U
#define GPIO_GPFMUX1_GPIO167_M    0xC000U      // Defines pin-muxing selection
                                               // for GPIO167
#define GPIO_GPFMUX1_GPIO168_S    16U
#define GPIO_GPFMUX1_GPIO168_M    0x30000U     // Defines pin-muxing selection
                                               // for GPIO168

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFDIR register
//
//*****************************************************************************
#define GPIO_GPFDIR_GPIO160       0x1U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPFDIR_GPIO161       0x2U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPFDIR_GPIO162       0x4U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPFDIR_GPIO163       0x8U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPFDIR_GPIO164       0x10U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPFDIR_GPIO165       0x20U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPFDIR_GPIO166       0x40U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPFDIR_GPIO167       0x80U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPFDIR_GPIO168       0x100U       // Defines direction for this
                                               // pin in GPIO mode

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFPUD register
//
//*****************************************************************************
#define GPIO_GPFPUD_GPIO160       0x1U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPFPUD_GPIO161       0x2U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPFPUD_GPIO162       0x4U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPFPUD_GPIO163       0x8U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPFPUD_GPIO164       0x10U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPFPUD_GPIO165       0x20U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPFPUD_GPIO166       0x40U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPFPUD_GPIO167       0x80U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPFPUD_GPIO168       0x100U       // Pull-Up Disable control for
                                               // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFINV register
//
//*****************************************************************************
#define GPIO_GPFINV_GPIO160       0x1U         // Input inversion control for
                                               // this pin
#define GPIO_GPFINV_GPIO161       0x2U         // Input inversion control for
                                               // this pin
#define GPIO_GPFINV_GPIO162       0x4U         // Input inversion control for
                                               // this pin
#define GPIO_GPFINV_GPIO163       0x8U         // Input inversion control for
                                               // this pin
#define GPIO_GPFINV_GPIO164       0x10U        // Input inversion control for
                                               // this pin
#define GPIO_GPFINV_GPIO165       0x20U        // Input inversion control for
                                               // this pin
#define GPIO_GPFINV_GPIO166       0x40U        // Input inversion control for
                                               // this pin
#define GPIO_GPFINV_GPIO167       0x80U        // Input inversion control for
                                               // this pin
#define GPIO_GPFINV_GPIO168       0x100U       // Input inversion control for
                                               // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFODR register
//
//*****************************************************************************
#define GPIO_GPFODR_GPIO160       0x1U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPFODR_GPIO161       0x2U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPFODR_GPIO162       0x4U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPFODR_GPIO163       0x8U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPFODR_GPIO164       0x10U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPFODR_GPIO165       0x20U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPFODR_GPIO166       0x40U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPFODR_GPIO167       0x80U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPFODR_GPIO168       0x100U       // Outpout Open-Drain control
                                               // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFGMUX1 register
//
//*****************************************************************************
#define GPIO_GPFGMUX1_GPIO160_S   0U
#define GPIO_GPFGMUX1_GPIO160_M   0x3U         // Defines pin-muxing selection
                                               // for GPIO160
#define GPIO_GPFGMUX1_GPIO161_S   2U
#define GPIO_GPFGMUX1_GPIO161_M   0xCU         // Defines pin-muxing selection
                                               // for GPIO161
#define GPIO_GPFGMUX1_GPIO162_S   4U
#define GPIO_GPFGMUX1_GPIO162_M   0x30U        // Defines pin-muxing selection
                                               // for GPIO162
#define GPIO_GPFGMUX1_GPIO163_S   6U
#define GPIO_GPFGMUX1_GPIO163_M   0xC0U        // Defines pin-muxing selection
                                               // for GPIO163
#define GPIO_GPFGMUX1_GPIO164_S   8U
#define GPIO_GPFGMUX1_GPIO164_M   0x300U       // Defines pin-muxing selection
                                               // for GPIO164
#define GPIO_GPFGMUX1_GPIO165_S   10U
#define GPIO_GPFGMUX1_GPIO165_M   0xC00U       // Defines pin-muxing selection
                                               // for GPIO165
#define GPIO_GPFGMUX1_GPIO166_S   12U
#define GPIO_GPFGMUX1_GPIO166_M   0x3000U      // Defines pin-muxing selection
                                               // for GPIO166
#define GPIO_GPFGMUX1_GPIO167_S   14U
#define GPIO_GPFGMUX1_GPIO167_M   0xC000U      // Defines pin-muxing selection
                                               // for GPIO167
#define GPIO_GPFGMUX1_GPIO168_S   16U
#define GPIO_GPFGMUX1_GPIO168_M   0x30000U     // Defines pin-muxing selection
                                               // for GPIO168

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFCSEL1 register
//
//*****************************************************************************
#define GPIO_GPFCSEL1_GPIO160_S   0U
#define GPIO_GPFCSEL1_GPIO160_M   0xFU         // GPIO160 Master CPU Select
#define GPIO_GPFCSEL1_GPIO161_S   4U
#define GPIO_GPFCSEL1_GPIO161_M   0xF0U        // GPIO161 Master CPU Select
#define GPIO_GPFCSEL1_GPIO162_S   8U
#define GPIO_GPFCSEL1_GPIO162_M   0xF00U       // GPIO162 Master CPU Select
#define GPIO_GPFCSEL1_GPIO163_S   12U
#define GPIO_GPFCSEL1_GPIO163_M   0xF000U      // GPIO163 Master CPU Select
#define GPIO_GPFCSEL1_GPIO164_S   16U
#define GPIO_GPFCSEL1_GPIO164_M   0xF0000U     // GPIO164 Master CPU Select
#define GPIO_GPFCSEL1_GPIO165_S   20U
#define GPIO_GPFCSEL1_GPIO165_M   0xF00000U    // GPIO165 Master CPU Select
#define GPIO_GPFCSEL1_GPIO166_S   24U
#define GPIO_GPFCSEL1_GPIO166_M   0xF000000U   // GPIO166 Master CPU Select
#define GPIO_GPFCSEL1_GPIO167_S   28U
#define GPIO_GPFCSEL1_GPIO167_M   0xF0000000U  // GPIO167 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFCSEL2 register
//
//*****************************************************************************
#define GPIO_GPFCSEL2_GPIO168_S   0U
#define GPIO_GPFCSEL2_GPIO168_M   0xFU         // GPIO168 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFLOCK register
//
//*****************************************************************************
#define GPIO_GPFLOCK_GPIO160      0x1U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPFLOCK_GPIO161      0x2U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPFLOCK_GPIO162      0x4U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPFLOCK_GPIO163      0x8U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPFLOCK_GPIO164      0x10U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPFLOCK_GPIO165      0x20U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPFLOCK_GPIO166      0x40U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPFLOCK_GPIO167      0x80U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPFLOCK_GPIO168      0x100U       // Configuration Lock bit for
                                               // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFCR register
//
//*****************************************************************************
#define GPIO_GPFCR_GPIO160        0x1U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPFCR_GPIO161        0x2U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPFCR_GPIO162        0x4U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPFCR_GPIO163        0x8U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPFCR_GPIO164        0x10U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPFCR_GPIO165        0x20U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPFCR_GPIO166        0x40U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPFCR_GPIO167        0x80U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPFCR_GPIO168        0x100U       // Configuration lock commit bit
                                               // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPADAT register
//
//*****************************************************************************
#define GPIO_GPADAT_GPIO0         0x1U         // Data Register for this pin
#define GPIO_GPADAT_GPIO1         0x2U         // Data Register for this pin
#define GPIO_GPADAT_GPIO2         0x4U         // Data Register for this pin
#define GPIO_GPADAT_GPIO3         0x8U         // Data Register for this pin
#define GPIO_GPADAT_GPIO4         0x10U        // Data Register for this pin
#define GPIO_GPADAT_GPIO5         0x20U        // Data Register for this pin
#define GPIO_GPADAT_GPIO6         0x40U        // Data Register for this pin
#define GPIO_GPADAT_GPIO7         0x80U        // Data Register for this pin
#define GPIO_GPADAT_GPIO8         0x100U       // Data Register for this pin
#define GPIO_GPADAT_GPIO9         0x200U       // Data Register for this pin
#define GPIO_GPADAT_GPIO10        0x400U       // Data Register for this pin
#define GPIO_GPADAT_GPIO11        0x800U       // Data Register for this pin
#define GPIO_GPADAT_GPIO12        0x1000U      // Data Register for this pin
#define GPIO_GPADAT_GPIO13        0x2000U      // Data Register for this pin
#define GPIO_GPADAT_GPIO14        0x4000U      // Data Register for this pin
#define GPIO_GPADAT_GPIO15        0x8000U      // Data Register for this pin
#define GPIO_GPADAT_GPIO16        0x10000U     // Data Register for this pin
#define GPIO_GPADAT_GPIO17        0x20000U     // Data Register for this pin
#define GPIO_GPADAT_GPIO18        0x40000U     // Data Register for this pin
#define GPIO_GPADAT_GPIO19        0x80000U     // Data Register for this pin
#define GPIO_GPADAT_GPIO20        0x100000U    // Data Register for this pin
#define GPIO_GPADAT_GPIO21        0x200000U    // Data Register for this pin
#define GPIO_GPADAT_GPIO22        0x400000U    // Data Register for this pin
#define GPIO_GPADAT_GPIO23        0x800000U    // Data Register for this pin
#define GPIO_GPADAT_GPIO24        0x1000000U   // Data Register for this pin
#define GPIO_GPADAT_GPIO25        0x2000000U   // Data Register for this pin
#define GPIO_GPADAT_GPIO26        0x4000000U   // Data Register for this pin
#define GPIO_GPADAT_GPIO27        0x8000000U   // Data Register for this pin
#define GPIO_GPADAT_GPIO28        0x10000000U  // Data Register for this pin
#define GPIO_GPADAT_GPIO29        0x20000000U  // Data Register for this pin
#define GPIO_GPADAT_GPIO30        0x40000000U  // Data Register for this pin
#define GPIO_GPADAT_GPIO31        0x80000000U  // Data Register for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPASET register
//
//*****************************************************************************
#define GPIO_GPASET_GPIO0         0x1U         // Output Set bit for this pin
#define GPIO_GPASET_GPIO1         0x2U         // Output Set bit for this pin
#define GPIO_GPASET_GPIO2         0x4U         // Output Set bit for this pin
#define GPIO_GPASET_GPIO3         0x8U         // Output Set bit for this pin
#define GPIO_GPASET_GPIO4         0x10U        // Output Set bit for this pin
#define GPIO_GPASET_GPIO5         0x20U        // Output Set bit for this pin
#define GPIO_GPASET_GPIO6         0x40U        // Output Set bit for this pin
#define GPIO_GPASET_GPIO7         0x80U        // Output Set bit for this pin
#define GPIO_GPASET_GPIO8         0x100U       // Output Set bit for this pin
#define GPIO_GPASET_GPIO9         0x200U       // Output Set bit for this pin
#define GPIO_GPASET_GPIO10        0x400U       // Output Set bit for this pin
#define GPIO_GPASET_GPIO11        0x800U       // Output Set bit for this pin
#define GPIO_GPASET_GPIO12        0x1000U      // Output Set bit for this pin
#define GPIO_GPASET_GPIO13        0x2000U      // Output Set bit for this pin
#define GPIO_GPASET_GPIO14        0x4000U      // Output Set bit for this pin
#define GPIO_GPASET_GPIO15        0x8000U      // Output Set bit for this pin
#define GPIO_GPASET_GPIO16        0x10000U     // Output Set bit for this pin
#define GPIO_GPASET_GPIO17        0x20000U     // Output Set bit for this pin
#define GPIO_GPASET_GPIO18        0x40000U     // Output Set bit for this pin
#define GPIO_GPASET_GPIO19        0x80000U     // Output Set bit for this pin
#define GPIO_GPASET_GPIO20        0x100000U    // Output Set bit for this pin
#define GPIO_GPASET_GPIO21        0x200000U    // Output Set bit for this pin
#define GPIO_GPASET_GPIO22        0x400000U    // Output Set bit for this pin
#define GPIO_GPASET_GPIO23        0x800000U    // Output Set bit for this pin
#define GPIO_GPASET_GPIO24        0x1000000U   // Output Set bit for this pin
#define GPIO_GPASET_GPIO25        0x2000000U   // Output Set bit for this pin
#define GPIO_GPASET_GPIO26        0x4000000U   // Output Set bit for this pin
#define GPIO_GPASET_GPIO27        0x8000000U   // Output Set bit for this pin
#define GPIO_GPASET_GPIO28        0x10000000U  // Output Set bit for this pin
#define GPIO_GPASET_GPIO29        0x20000000U  // Output Set bit for this pin
#define GPIO_GPASET_GPIO30        0x40000000U  // Output Set bit for this pin
#define GPIO_GPASET_GPIO31        0x80000000U  // Output Set bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPACLEAR register
//
//*****************************************************************************
#define GPIO_GPACLEAR_GPIO0       0x1U         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO1       0x2U         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO2       0x4U         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO3       0x8U         // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO4       0x10U        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO5       0x20U        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO6       0x40U        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO7       0x80U        // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO8       0x100U       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO9       0x200U       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO10      0x400U       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO11      0x800U       // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO12      0x1000U      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO13      0x2000U      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO14      0x4000U      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO15      0x8000U      // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO16      0x10000U     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO17      0x20000U     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO18      0x40000U     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO19      0x80000U     // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO20      0x100000U    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO21      0x200000U    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO22      0x400000U    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO23      0x800000U    // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO24      0x1000000U   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO25      0x2000000U   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO26      0x4000000U   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO27      0x8000000U   // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO28      0x10000000U  // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO29      0x20000000U  // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO30      0x40000000U  // Output Clear bit for this pin
#define GPIO_GPACLEAR_GPIO31      0x80000000U  // Output Clear bit for this pin

