tdloe/tms320-rpi-serial/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPCCLEAR register
//
//*****************************************************************************
#define GPIO_GPCCLEAR_GPIO64      0x1U         // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO65      0x2U         // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO66      0x4U         // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO67      0x8U         // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO68      0x10U        // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO69      0x20U        // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO70      0x40U        // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO71      0x80U        // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO72      0x100U       // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO73      0x200U       // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO74      0x400U       // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO75      0x800U       // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO76      0x1000U      // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO77      0x2000U      // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO78      0x4000U      // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO79      0x8000U      // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO80      0x10000U     // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO81      0x20000U     // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO82      0x40000U     // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO83      0x80000U     // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO84      0x100000U    // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO85      0x200000U    // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO86      0x400000U    // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO87      0x800000U    // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO88      0x1000000U   // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO89      0x2000000U   // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO90      0x4000000U   // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO91      0x8000000U   // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO92      0x10000000U  // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO93      0x20000000U  // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO94      0x40000000U  // Output Clear bit for this pin
#define GPIO_GPCCLEAR_GPIO95      0x80000000U  // Output Clear bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCTOGGLE register
//
//*****************************************************************************
#define GPIO_GPCTOGGLE_GPIO64     0x1U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO65     0x2U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO66     0x4U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO67     0x8U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO68     0x10U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO69     0x20U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO70     0x40U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO71     0x80U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO72     0x100U       // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO73     0x200U       // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO74     0x400U       // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO75     0x800U       // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO76     0x1000U      // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO77     0x2000U      // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO78     0x4000U      // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO79     0x8000U      // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO80     0x10000U     // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO81     0x20000U     // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO82     0x40000U     // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO83     0x80000U     // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO84     0x100000U    // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO85     0x200000U    // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO86     0x400000U    // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO87     0x800000U    // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO88     0x1000000U   // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO89     0x2000000U   // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO90     0x4000000U   // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO91     0x8000000U   // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO92     0x10000000U  // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO93     0x20000000U  // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO94     0x40000000U  // Output Toggle bit for this
                                               // pin
#define GPIO_GPCTOGGLE_GPIO95     0x80000000U  // Output Toggle bit for this
                                               // pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDDAT register
//
//*****************************************************************************
#define GPIO_GPDDAT_GPIO96        0x1U         // Data Register for this pin
#define GPIO_GPDDAT_GPIO97        0x2U         // Data Register for this pin
#define GPIO_GPDDAT_GPIO98        0x4U         // Data Register for this pin
#define GPIO_GPDDAT_GPIO99        0x8U         // Data Register for this pin
#define GPIO_GPDDAT_GPIO100       0x10U        // Data Register for this pin
#define GPIO_GPDDAT_GPIO101       0x20U        // Data Register for this pin
#define GPIO_GPDDAT_GPIO102       0x40U        // Data Register for this pin
#define GPIO_GPDDAT_GPIO103       0x80U        // Data Register for this pin
#define GPIO_GPDDAT_GPIO104       0x100U       // Data Register for this pin
#define GPIO_GPDDAT_GPIO105       0x200U       // Data Register for this pin
#define GPIO_GPDDAT_GPIO106       0x400U       // Data Register for this pin
#define GPIO_GPDDAT_GPIO107       0x800U       // Data Register for this pin
#define GPIO_GPDDAT_GPIO108       0x1000U      // Data Register for this pin
#define GPIO_GPDDAT_GPIO109       0x2000U      // Data Register for this pin
#define GPIO_GPDDAT_GPIO110       0x4000U      // Data Register for this pin
#define GPIO_GPDDAT_GPIO111       0x8000U      // Data Register for this pin
#define GPIO_GPDDAT_GPIO112       0x10000U     // Data Register for this pin
#define GPIO_GPDDAT_GPIO113       0x20000U     // Data Register for this pin
#define GPIO_GPDDAT_GPIO114       0x40000U     // Data Register for this pin
#define GPIO_GPDDAT_GPIO115       0x80000U     // Data Register for this pin
#define GPIO_GPDDAT_GPIO116       0x100000U    // Data Register for this pin
#define GPIO_GPDDAT_GPIO117       0x200000U    // Data Register for this pin
#define GPIO_GPDDAT_GPIO118       0x400000U    // Data Register for this pin
#define GPIO_GPDDAT_GPIO119       0x800000U    // Data Register for this pin
#define GPIO_GPDDAT_GPIO120       0x1000000U   // Data Register for this pin
#define GPIO_GPDDAT_GPIO121       0x2000000U   // Data Register for this pin
#define GPIO_GPDDAT_GPIO122       0x4000000U   // Data Register for this pin
#define GPIO_GPDDAT_GPIO123       0x8000000U   // Data Register for this pin
#define GPIO_GPDDAT_GPIO124       0x10000000U  // Data Register for this pin
#define GPIO_GPDDAT_GPIO125       0x20000000U  // Data Register for this pin
#define GPIO_GPDDAT_GPIO126       0x40000000U  // Data Register for this pin
#define GPIO_GPDDAT_GPIO127       0x80000000U  // Data Register for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDSET register
//
//*****************************************************************************
#define GPIO_GPDSET_GPIO96        0x1U         // Output Set bit for this pin
#define GPIO_GPDSET_GPIO97        0x2U         // Output Set bit for this pin
#define GPIO_GPDSET_GPIO98        0x4U         // Output Set bit for this pin
#define GPIO_GPDSET_GPIO99        0x8U         // Output Set bit for this pin
#define GPIO_GPDSET_GPIO100       0x10U        // Output Set bit for this pin
#define GPIO_GPDSET_GPIO101       0x20U        // Output Set bit for this pin
#define GPIO_GPDSET_GPIO102       0x40U        // Output Set bit for this pin
#define GPIO_GPDSET_GPIO103       0x80U        // Output Set bit for this pin
#define GPIO_GPDSET_GPIO104       0x100U       // Output Set bit for this pin
#define GPIO_GPDSET_GPIO105       0x200U       // Output Set bit for this pin
#define GPIO_GPDSET_GPIO106       0x400U       // Output Set bit for this pin
#define GPIO_GPDSET_GPIO107       0x800U       // Output Set bit for this pin
#define GPIO_GPDSET_GPIO108       0x1000U      // Output Set bit for this pin
#define GPIO_GPDSET_GPIO109       0x2000U      // Output Set bit for this pin
#define GPIO_GPDSET_GPIO110       0x4000U      // Output Set bit for this pin
#define GPIO_GPDSET_GPIO111       0x8000U      // Output Set bit for this pin
#define GPIO_GPDSET_GPIO112       0x10000U     // Output Set bit for this pin
#define GPIO_GPDSET_GPIO113       0x20000U     // Output Set bit for this pin
#define GPIO_GPDSET_GPIO114       0x40000U     // Output Set bit for this pin
#define GPIO_GPDSET_GPIO115       0x80000U     // Output Set bit for this pin
#define GPIO_GPDSET_GPIO116       0x100000U    // Output Set bit for this pin
#define GPIO_GPDSET_GPIO117       0x200000U    // Output Set bit for this pin
#define GPIO_GPDSET_GPIO118       0x400000U    // Output Set bit for this pin
#define GPIO_GPDSET_GPIO119       0x800000U    // Output Set bit for this pin
#define GPIO_GPDSET_GPIO120       0x1000000U   // Output Set bit for this pin
#define GPIO_GPDSET_GPIO121       0x2000000U   // Output Set bit for this pin
#define GPIO_GPDSET_GPIO122       0x4000000U   // Output Set bit for this pin
#define GPIO_GPDSET_GPIO123       0x8000000U   // Output Set bit for this pin
#define GPIO_GPDSET_GPIO124       0x10000000U  // Output Set bit for this pin
#define GPIO_GPDSET_GPIO125       0x20000000U  // Output Set bit for this pin
#define GPIO_GPDSET_GPIO126       0x40000000U  // Output Set bit for this pin
#define GPIO_GPDSET_GPIO127       0x80000000U  // Output Set bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDCLEAR register
//
//*****************************************************************************
#define GPIO_GPDCLEAR_GPIO96      0x1U         // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO97      0x2U         // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO98      0x4U         // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO99      0x8U         // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO100     0x10U        // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO101     0x20U        // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO102     0x40U        // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO103     0x80U        // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO104     0x100U       // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO105     0x200U       // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO106     0x400U       // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO107     0x800U       // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO108     0x1000U      // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO109     0x2000U      // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO110     0x4000U      // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO111     0x8000U      // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO112     0x10000U     // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO113     0x20000U     // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO114     0x40000U     // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO115     0x80000U     // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO116     0x100000U    // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO117     0x200000U    // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO118     0x400000U    // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO119     0x800000U    // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO120     0x1000000U   // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO121     0x2000000U   // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO122     0x4000000U   // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO123     0x8000000U   // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO124     0x10000000U  // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO125     0x20000000U  // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO126     0x40000000U  // Output Clear bit for this pin
#define GPIO_GPDCLEAR_GPIO127     0x80000000U  // Output Clear bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPDTOGGLE register
//
//*****************************************************************************
#define GPIO_GPDTOGGLE_GPIO96     0x1U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO97     0x2U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO98     0x4U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO99     0x8U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO100    0x10U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO101    0x20U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO102    0x40U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO103    0x80U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO104    0x100U       // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO105    0x200U       // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO106    0x400U       // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO107    0x800U       // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO108    0x1000U      // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO109    0x2000U      // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO110    0x4000U      // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO111    0x8000U      // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO112    0x10000U     // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO113    0x20000U     // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO114    0x40000U     // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO115    0x80000U     // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO116    0x100000U    // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO117    0x200000U    // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO118    0x400000U    // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO119    0x800000U    // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO120    0x1000000U   // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO121    0x2000000U   // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO122    0x4000000U   // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO123    0x8000000U   // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO124    0x10000000U  // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO125    0x20000000U  // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO126    0x40000000U  // Output Toggle bit for this
                                               // pin
#define GPIO_GPDTOGGLE_GPIO127    0x80000000U  // Output Toggle bit for this
                                               // pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEDAT register
//
//*****************************************************************************
#define GPIO_GPEDAT_GPIO128       0x1U         // Data Register for this pin
#define GPIO_GPEDAT_GPIO129       0x2U         // Data Register for this pin
#define GPIO_GPEDAT_GPIO130       0x4U         // Data Register for this pin
#define GPIO_GPEDAT_GPIO131       0x8U         // Data Register for this pin
#define GPIO_GPEDAT_GPIO132       0x10U        // Data Register for this pin
#define GPIO_GPEDAT_GPIO133       0x20U        // Data Register for this pin
#define GPIO_GPEDAT_GPIO134       0x40U        // Data Register for this pin
#define GPIO_GPEDAT_GPIO135       0x80U        // Data Register for this pin
#define GPIO_GPEDAT_GPIO136       0x100U       // Data Register for this pin
#define GPIO_GPEDAT_GPIO137       0x200U       // Data Register for this pin
#define GPIO_GPEDAT_GPIO138       0x400U       // Data Register for this pin
#define GPIO_GPEDAT_GPIO139       0x800U       // Data Register for this pin
#define GPIO_GPEDAT_GPIO140       0x1000U      // Data Register for this pin
#define GPIO_GPEDAT_GPIO141       0x2000U      // Data Register for this pin
#define GPIO_GPEDAT_GPIO142       0x4000U      // Data Register for this pin
#define GPIO_GPEDAT_GPIO143       0x8000U      // Data Register for this pin
#define GPIO_GPEDAT_GPIO144       0x10000U     // Data Register for this pin
#define GPIO_GPEDAT_GPIO145       0x20000U     // Data Register for this pin
#define GPIO_GPEDAT_GPIO146       0x40000U     // Data Register for this pin
#define GPIO_GPEDAT_GPIO147       0x80000U     // Data Register for this pin
#define GPIO_GPEDAT_GPIO148       0x100000U    // Data Register for this pin
#define GPIO_GPEDAT_GPIO149       0x200000U    // Data Register for this pin
#define GPIO_GPEDAT_GPIO150       0x400000U    // Data Register for this pin
#define GPIO_GPEDAT_GPIO151       0x800000U    // Data Register for this pin
#define GPIO_GPEDAT_GPIO152       0x1000000U   // Data Register for this pin
#define GPIO_GPEDAT_GPIO153       0x2000000U   // Data Register for this pin
#define GPIO_GPEDAT_GPIO154       0x4000000U   // Data Register for this pin
#define GPIO_GPEDAT_GPIO155       0x8000000U   // Data Register for this pin
#define GPIO_GPEDAT_GPIO156       0x10000000U  // Data Register for this pin
#define GPIO_GPEDAT_GPIO157       0x20000000U  // Data Register for this pin
#define GPIO_GPEDAT_GPIO158       0x40000000U  // Data Register for this pin
#define GPIO_GPEDAT_GPIO159       0x80000000U  // Data Register for this pin

