tdloe/tms320-rpi-serial/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPESET register
//
//*****************************************************************************
#define GPIO_GPESET_GPIO128       0x1U         // Output Set bit for this pin
#define GPIO_GPESET_GPIO129       0x2U         // Output Set bit for this pin
#define GPIO_GPESET_GPIO130       0x4U         // Output Set bit for this pin
#define GPIO_GPESET_GPIO131       0x8U         // Output Set bit for this pin
#define GPIO_GPESET_GPIO132       0x10U        // Output Set bit for this pin
#define GPIO_GPESET_GPIO133       0x20U        // Output Set bit for this pin
#define GPIO_GPESET_GPIO134       0x40U        // Output Set bit for this pin
#define GPIO_GPESET_GPIO135       0x80U        // Output Set bit for this pin
#define GPIO_GPESET_GPIO136       0x100U       // Output Set bit for this pin
#define GPIO_GPESET_GPIO137       0x200U       // Output Set bit for this pin
#define GPIO_GPESET_GPIO138       0x400U       // Output Set bit for this pin
#define GPIO_GPESET_GPIO139       0x800U       // Output Set bit for this pin
#define GPIO_GPESET_GPIO140       0x1000U      // Output Set bit for this pin
#define GPIO_GPESET_GPIO141       0x2000U      // Output Set bit for this pin
#define GPIO_GPESET_GPIO142       0x4000U      // Output Set bit for this pin
#define GPIO_GPESET_GPIO143       0x8000U      // Output Set bit for this pin
#define GPIO_GPESET_GPIO144       0x10000U     // Output Set bit for this pin
#define GPIO_GPESET_GPIO145       0x20000U     // Output Set bit for this pin
#define GPIO_GPESET_GPIO146       0x40000U     // Output Set bit for this pin
#define GPIO_GPESET_GPIO147       0x80000U     // Output Set bit for this pin
#define GPIO_GPESET_GPIO148       0x100000U    // Output Set bit for this pin
#define GPIO_GPESET_GPIO149       0x200000U    // Output Set bit for this pin
#define GPIO_GPESET_GPIO150       0x400000U    // Output Set bit for this pin
#define GPIO_GPESET_GPIO151       0x800000U    // Output Set bit for this pin
#define GPIO_GPESET_GPIO152       0x1000000U   // Output Set bit for this pin
#define GPIO_GPESET_GPIO153       0x2000000U   // Output Set bit for this pin
#define GPIO_GPESET_GPIO154       0x4000000U   // Output Set bit for this pin
#define GPIO_GPESET_GPIO155       0x8000000U   // Output Set bit for this pin
#define GPIO_GPESET_GPIO156       0x10000000U  // Output Set bit for this pin
#define GPIO_GPESET_GPIO157       0x20000000U  // Output Set bit for this pin
#define GPIO_GPESET_GPIO158       0x40000000U  // Output Set bit for this pin
#define GPIO_GPESET_GPIO159       0x80000000U  // Output Set bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPECLEAR register
//
//*****************************************************************************
#define GPIO_GPECLEAR_GPIO128     0x1U         // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO129     0x2U         // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO130     0x4U         // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO131     0x8U         // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO132     0x10U        // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO133     0x20U        // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO134     0x40U        // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO135     0x80U        // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO136     0x100U       // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO137     0x200U       // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO138     0x400U       // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO139     0x800U       // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO140     0x1000U      // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO141     0x2000U      // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO142     0x4000U      // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO143     0x8000U      // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO144     0x10000U     // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO145     0x20000U     // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO146     0x40000U     // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO147     0x80000U     // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO148     0x100000U    // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO149     0x200000U    // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO150     0x400000U    // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO151     0x800000U    // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO152     0x1000000U   // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO153     0x2000000U   // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO154     0x4000000U   // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO155     0x8000000U   // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO156     0x10000000U  // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO157     0x20000000U  // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO158     0x40000000U  // Output Clear bit for this pin
#define GPIO_GPECLEAR_GPIO159     0x80000000U  // Output Clear bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPETOGGLE register
//
//*****************************************************************************
#define GPIO_GPETOGGLE_GPIO128    0x1U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO129    0x2U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO130    0x4U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO131    0x8U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO132    0x10U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO133    0x20U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO134    0x40U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO135    0x80U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO136    0x100U       // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO137    0x200U       // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO138    0x400U       // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO139    0x800U       // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO140    0x1000U      // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO141    0x2000U      // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO142    0x4000U      // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO143    0x8000U      // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO144    0x10000U     // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO145    0x20000U     // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO146    0x40000U     // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO147    0x80000U     // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO148    0x100000U    // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO149    0x200000U    // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO150    0x400000U    // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO151    0x800000U    // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO152    0x1000000U   // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO153    0x2000000U   // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO154    0x4000000U   // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO155    0x8000000U   // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO156    0x10000000U  // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO157    0x20000000U  // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO158    0x40000000U  // Output Toggle bit for this
                                               // pin
#define GPIO_GPETOGGLE_GPIO159    0x80000000U  // Output Toggle bit for this
                                               // pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFDAT register
//
//*****************************************************************************
#define GPIO_GPFDAT_GPIO160       0x1U         // Data Register for this pin
#define GPIO_GPFDAT_GPIO161       0x2U         // Data Register for this pin
#define GPIO_GPFDAT_GPIO162       0x4U         // Data Register for this pin
#define GPIO_GPFDAT_GPIO163       0x8U         // Data Register for this pin
#define GPIO_GPFDAT_GPIO164       0x10U        // Data Register for this pin
#define GPIO_GPFDAT_GPIO165       0x20U        // Data Register for this pin
#define GPIO_GPFDAT_GPIO166       0x40U        // Data Register for this pin
#define GPIO_GPFDAT_GPIO167       0x80U        // Data Register for this pin
#define GPIO_GPFDAT_GPIO168       0x100U       // Data Register for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFSET register
//
//*****************************************************************************
#define GPIO_GPFSET_GPIO160       0x1U         // Output Set bit for this pin
#define GPIO_GPFSET_GPIO161       0x2U         // Output Set bit for this pin
#define GPIO_GPFSET_GPIO162       0x4U         // Output Set bit for this pin
#define GPIO_GPFSET_GPIO163       0x8U         // Output Set bit for this pin
#define GPIO_GPFSET_GPIO164       0x10U        // Output Set bit for this pin
#define GPIO_GPFSET_GPIO165       0x20U        // Output Set bit for this pin
#define GPIO_GPFSET_GPIO166       0x40U        // Output Set bit for this pin
#define GPIO_GPFSET_GPIO167       0x80U        // Output Set bit for this pin
#define GPIO_GPFSET_GPIO168       0x100U       // Output Set bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFCLEAR register
//
//*****************************************************************************
#define GPIO_GPFCLEAR_GPIO160     0x1U         // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO161     0x2U         // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO162     0x4U         // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO163     0x8U         // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO164     0x10U        // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO165     0x20U        // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO166     0x40U        // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO167     0x80U        // Output Clear bit for this pin
#define GPIO_GPFCLEAR_GPIO168     0x100U       // Output Clear bit for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFTOGGLE register
//
//*****************************************************************************
#define GPIO_GPFTOGGLE_GPIO160    0x1U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPFTOGGLE_GPIO161    0x2U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPFTOGGLE_GPIO162    0x4U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPFTOGGLE_GPIO163    0x8U         // Output Toggle bit for this
                                               // pin
#define GPIO_GPFTOGGLE_GPIO164    0x10U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPFTOGGLE_GPIO165    0x20U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPFTOGGLE_GPIO166    0x40U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPFTOGGLE_GPIO167    0x80U        // Output Toggle bit for this
                                               // pin
#define GPIO_GPFTOGGLE_GPIO168    0x100U       // Output Toggle bit for this
                                               // pin
#endif
